<?php

return array(

    /*
    |--------------------------------------------------------------------------
    | Date Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used by the date library. Each line can
    | have a singular and plural translation separated by a '|'.
    |
    */

    'ago'       => 'منذ :time',
    'from_now'  => 'من الآن :time',
    'after'     => 'بعد :time',
    'before'    => 'قبل :time',
    'year'      => '{0}سنة|{1}سنة|{2}سنتين|[3,10]:count سنوات|[11,Inf]:count سنة',
    'month'     => '{0}شهر|{1}شهر|{2}شهرين|[3,10]:count أشهر|[11,Inf]:count شهر',
    'week'      => '{0}أسبوع|{1}أسبوع|{2}أسبوعين|[3,10]:count أسابيع|[11,Inf]:count أسبوع',
    'day'       => '{0}يوم|{1}يوم|{2}يومين|[3,10]:count أيام|[11,Inf]:count يوم',
    'hour'      => '{0}ساعة|{1}ساعة|{2}ساعتين|[3,10]:count ساعات|[11,Inf]:count ساعة',
    'minute'    => '{0}دقيقة|{1}دقيقة|{2}دقيقتين|[3,10]:count دقائق|[11,Inf]:count دقيقة',
    'second'    => '{0}ثانية|{1}ثانية|{2}ثانيتين|[3,10]:count ثوان|[11,Inf]:count ثانية',

    'january'   => 'يناير',
    'february'  => 'فبراير',
    'march'     => 'مارس',
    'april'     => 'إبريل',
    'may'       => 'مايو',
    'june'      => 'يونيو',
    'july'      => 'يوليو',
    'august'    => 'أغسطس',
    'september' => 'سبتمبر',
    'october'   => 'أكتوبر',
    'november'  => 'نوفمبر',
    'december'  => 'ديسمبر',

    'monday'    => 'الإثنين',
    'tuesday'   => 'الثلاثاء',
    'wednesday' => 'الأربعاء',
    'thursday'  => 'الخميس',
    'friday'    => 'الجمعة',
    'saturday'  => 'السبت',
    'sunday'    => 'الأحد',


 'monthNames'  => array (
  'wide' => 
  array (
    1 => 'يناير',
    2 => 'فبراير',
    3 => 'مارس',
    4 => 'أبريل',
    5 => 'مايو',
    6 => 'يونيو',
    7 => 'يوليو',
    8 => 'أغسطس',
    9 => 'سبتمبر',
    10 => 'أكتوبر',
    11 => 'نوفمبر',
    12 => 'ديسمبر',
  ),
  'abbreviated' => 
  array (
    1 => 'يناير',
    2 => 'فبراير',
    3 => 'مارس',
    4 => 'أبريل',
    5 => 'مايو',
    6 => 'يونيو',
    7 => 'يوليو',
    8 => 'أغسطس',
    9 => 'سبتمبر',
    10 => 'أكتوبر',
    11 => 'نوفمبر',
    12 => 'ديسمبر',
  ),
),

 'weekDayNames'  => array (
  'wide' => 
  array (
    0 => 'الأحد',
    1 => 'الاثنين',
    2 => 'الثلاثاء',
    3 => 'الأربعاء',
    4 => 'الخميس',
    5 => 'الجمعة',
    6 => 'السبت',
  ),
  'abbreviated' => 
  array (
    0 => 'الأحد',
    1 => 'الاثنين',
    2 => 'الثلاثاء',
    3 => 'الأربعاء',
    4 => 'الخميس',
    5 => 'الجمعة',
    6 => 'السبت',
  ),
  'short' => 
  array (
    0 => 'الأحد',
    1 => 'الاثنين',
    2 => 'الثلاثاء',
    3 => 'الأربعاء',
    4 => 'الخميس',
    5 => 'الجمعة',
    6 => 'السبت',
  ),
),

 'eraNames'  => array (
  'abbreviated' => 
  array (
    0 => 'ق.م',
    1 => 'م',
  ),
  'wide' => 
  array (
    0 => 'قبل الميلاد',
    1 => 'ميلادي',
  ),
  'narrow' => 
  array (
    0 => 'ق.م',
    1 => 'م',
  ),
),

 'dateFormats'  => array (
  'full' => 'EEEE، d MMMM، y',
  'long' => 'd MMMM، y',
  'medium' => 'dd‏/MM‏/y',
  'short' => 'd‏/M‏/y',
),

 'timeFormats'  => array (
  'full' => 'h:mm:ss a zzzz',
  'long' => 'h:mm:ss a z',
  'medium' => 'h:mm:ss a',
  'short' => 'h:mm a',
),

 'dateTimeFormat'  => '{1} {0}',

);
