<?php

return array(

    /*
    |--------------------------------------------------------------------------
    | Date Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used by the date library. Each line can
    | have a singular and plural translation separated by a '|'.
    |
    */

    'ago'       => 'πριν από :time',
    'from_now'  => 'σε :time από τώρα',
    'after'     => ':time μετά',
    'before'    => ':time πριν',
    'year'      => '1 χρόνο|:count χρόνια',
    'month'     => '1 μήνα|:count μήνες',
    'week'      => '1 εβδομάδα|:count εβδομάδες',
    'day'       => '1 μέρα|:count μέρες',
    'hour'      => '1 ώρα|:count ώρες',
    'minute'    => '1 λεπτό|:count λεπτά',
    'second'    => '1 δευτερόλεπτο|:count δευτερόλεπτα',

    'january'   => '{0}Ιανουάριος|{1}Ιανουαρίου',
    'february'  => '{0}Φεβρουάριος|{1}Φεβρουαρίου',
    'march'     => '{0}Μάρτιος|{1}Μαρτίου',
    'april'     => '{0}Απρίλιος|{1}Απριλίου',
    'may'       => '{0}Μάιος|{1}Μαΐου',
    'june'      => '{0}Ιούνιος|{1}Ιουνίου',
    'july'      => '{0}Ιούλιος|{1}Ιουλίου',
    'august'    => '{0}Αύγουστος|{1}Αυγούστου',
    'september' => '{0}Σεπτέμβριος|{1}Σεπτεμβρίου',
    'october'   => '{0}Οκτώβριος|{1}Οκτωβρίου',
    'november'  => '{0}Νοέμβριος|{1}Νοεμβρίου',
    'december'  => '{0}Δεκέμβριος|{1}Δεκεμβρίου',

    'monday'    => 'Δευτέρα',
    'tuesday'   => 'Τρίτη',
    'wednesday' => 'Τετάρτη',
    'thursday'  => 'Πέμπτη',
    'friday'    => 'Παρασκευή',
    'saturday'  => 'Σάββατο',
    'sunday'    => 'Κυριακή',

    'am'    =>  'πμ',
    'pm'    =>  'μμ'


 'monthNames'  => array (
  'wide' => 
  array (
    1 => 'Ιανουαρίου',
    2 => 'Φεβρουαρίου',
    3 => 'Μαρτίου',
    4 => 'Απριλίου',
    5 => 'Μαΐου',
    6 => 'Ιουνίου',
    7 => 'Ιουλίου',
    8 => 'Αυγούστου',
    9 => 'Σεπτεμβρίου',
    10 => 'Οκτωβρίου',
    11 => 'Νοεμβρίου',
    12 => 'Δεκεμβρίου',
  ),
  'abbreviated' => 
  array (
    1 => 'Ιαν',
    2 => 'Φεβ',
    3 => 'Μαρ',
    4 => 'Απρ',
    5 => 'Μαϊ',
    6 => 'Ιουν',
    7 => 'Ιουλ',
    8 => 'Αυγ',
    9 => 'Σεπ',
    10 => 'Οκτ',
    11 => 'Νοε',
    12 => 'Δεκ',
  ),
  'narrow' => 
  array (
    1 => 'Ι',
    2 => 'Φ',
    3 => 'Μ',
    4 => 'Α',
    5 => 'Μ',
    6 => 'Ι',
    7 => 'Ι',
    8 => 'Α',
    9 => 'Σ',
    10 => 'Ο',
    11 => 'Ν',
    12 => 'Δ',
  ),
),

 'weekDayNames'  => array (
  'wide' => 
  array (
    0 => 'Κυριακή',
    1 => 'Δευτέρα',
    2 => 'Τρίτη',
    3 => 'Τετάρτη',
    4 => 'Πέμπτη',
    5 => 'Παρασκευή',
    6 => 'Σάββατο',
  ),
  'abbreviated' => 
  array (
    0 => 'Κυρ',
    1 => 'Δευ',
    2 => 'Τρί',
    3 => 'Τετ',
    4 => 'Πέμ',
    5 => 'Παρ',
    6 => 'Σάβ',
  ),
  'narrow' => 
  array (
    0 => 'Κ',
    1 => 'Δ',
    2 => 'Τ',
    3 => 'Τ',
    4 => 'Π',
    5 => 'Π',
    6 => 'Σ',
  ),
  'short' => 
  array (
    0 => 'Κυ',
    1 => 'Δε',
    2 => 'Τρ',
    3 => 'Τε',
    4 => 'Πε',
    5 => 'Πα',
    6 => 'Σα',
  ),
),

 'eraNames'  => array (
  'abbreviated' => 
  array (
    0 => 'π.Χ.',
    1 => 'μ.Χ.',
  ),
  'wide' => 
  array (
    0 => 'π.Χ.',
    1 => 'μ.Χ.',
  ),
  'narrow' => 
  array (
    0 => 'π.Χ.',
    1 => 'μ.Χ.',
  ),
),

 'dateFormats'  => array (
  'full' => 'EEEE, d MMMM y',
  'long' => 'd MMMM y',
  'medium' => 'd MMM y',
  'short' => 'd/M/yy',
),

 'timeFormats'  => array (
  'full' => 'h:mm:ss a zzzz',
  'long' => 'h:mm:ss a z',
  'medium' => 'h:mm:ss a',
  'short' => 'h:mm a',
),

 'dateTimeFormat'  => '{1} - {0}',

);
