<?php

return array(

    /*
    |--------------------------------------------------------------------------
    | Date Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used by the date library. Each line can
    | have a singular and plural translation separated by a '|'.
    |
    */

    'ago'       => ':time назад',
    'from_now'  => 'через :time',
    'after'     => ':time после',
    'before'    => ':time до',
    'year'      => ':count год|:count года|:count лет',
    'month'     => ':count месяц|:count месяца|:count месяцев',
    'week'      => ':count неделю|:count недели|:count недель',
    'day'       => ':count день|:count дня|:count дней',
    'hour'      => ':count час|:count часа|:count часов',
    'minute'    => ':count минуту|:count минуты|:count минут',
    'second'    => ':count секунду|:count секунды|:count секунд',

    'january'   => '{0}январь|{1}января',
    'february'  => '{0}февраль|{1}февраля',
    'march'     => '{0}март|{1}мартa',
    'april'     => '{0}апрель|{1}апреля',
    'may'       => '{0}май|{1}мая',
    'june'      => '{0}июнь|{1}июня',
    'july'      => '{0}июль|{1}июля',
    'august'    => '{0}август|{1}августа',
    'september' => '{0}сентябрь|{1}сентября',
    'october'   => '{0}октябрь|{1}октября',
    'november'  => '{0}ноябрь|{1}ноября',
    'december'  => '{0}декабрь|{1}декабря',

    'monday'    => 'понедельник',
    'tuesday'   => 'вторник',
    'wednesday' => 'среда',
    'thursday'  => 'четверг',
    'friday'    => 'пятница',
    'saturday'  => 'суббота',
    'sunday'    => 'воскресенье',


 'monthNames'  => array (
  'wide' => 
  array (
    1 => 'января',
    2 => 'февраля',
    3 => 'марта',
    4 => 'апреля',
    5 => 'мая',
    6 => 'июня',
    7 => 'июля',
    8 => 'августа',
    9 => 'сентября',
    10 => 'октября',
    11 => 'ноября',
    12 => 'декабря',
  ),
  'abbreviated' => 
  array (
    1 => 'янв.',
    2 => 'февр.',
    3 => 'марта',
    4 => 'апр.',
    5 => 'мая',
    6 => 'июня',
    7 => 'июля',
    8 => 'авг.',
    9 => 'сент.',
    10 => 'окт.',
    11 => 'нояб.',
    12 => 'дек.',
  ),
  'narrow' => 
  array (
    1 => 'Я',
    2 => 'Ф',
    3 => 'М',
    4 => 'А',
    5 => 'М',
    6 => 'И',
    7 => 'И',
    8 => 'А',
    9 => 'С',
    10 => 'О',
    11 => 'Н',
    12 => 'Д',
  ),
),

 'weekDayNames'  => array (
  'wide' => 
  array (
    0 => 'воскресенье',
    1 => 'понедельник',
    2 => 'вторник',
    3 => 'среда',
    4 => 'четверг',
    5 => 'пятница',
    6 => 'суббота',
  ),
  'abbreviated' => 
  array (
    0 => 'вс',
    1 => 'пн',
    2 => 'вт',
    3 => 'ср',
    4 => 'чт',
    5 => 'пт',
    6 => 'сб',
  ),
  'narrow' => 
  array (
    0 => 'вс',
    1 => 'пн',
    2 => 'вт',
    3 => 'ср',
    4 => 'чт',
    5 => 'пт',
    6 => 'сб',
  ),
  'short' => 
  array (
    0 => 'вс',
    1 => 'пн',
    2 => 'вт',
    3 => 'ср',
    4 => 'чт',
    5 => 'пт',
    6 => 'сб',
  ),
),

 'eraNames'  => array (
  'abbreviated' => 
  array (
    0 => 'до н.э.',
    1 => 'н.э.',
  ),
  'wide' => 
  array (
    0 => 'до н.э.',
    1 => 'н.э.',
  ),
  'narrow' => 
  array (
    0 => 'до н.э.',
    1 => 'н.э.',
  ),
),

 'dateFormats'  => array (
  'full' => 'EEEE, d MMMM y \'г\'.',
  'long' => 'd MMMM y \'г\'.',
  'medium' => 'dd MMM y \'г\'.',
  'short' => 'dd.MM.yy',
),

 'timeFormats'  => array (
  'full' => 'H:mm:ss zzzz',
  'long' => 'H:mm:ss z',
  'medium' => 'H:mm:ss',
  'short' => 'H:mm',
),

 'dateTimeFormat'  => '{1}, {0}',

);
