<?php

return array(

    /*
    |--------------------------------------------------------------------------
    | Date Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used by the date library. Each line can
    | have a singular and plural translation separated by a '|'.
    |
    */

    'ago'       => ':time ที่แล้ว',
    'from_now'  => ':time จากนี้',
    'after'     => 'หลัง:time',
    'before'    => 'ก่อน:time',
    'year'      => '1 ปี|:count ปี',
    'month'     => '1 เดือน|:count เดือน',
    'week'      => '1 สัปดาห์|:count สัปดาห์',
    'day'       => '1 วัน|:count วัน',
    'hour'      => '1 ชั่วโมง|:count ชั่วโมง',
    'minute'    => '1 นาที|:count นาที',
    'second'    => '1 วินาที|:count วินาที',

    'january'   => 'มกราคม',
    'february'  => 'กุมภาพันธ์',
    'march'     => 'มีนาคม',
    'april'     => 'เมษายน',
    'may'       => 'พฤษภาคม',
    'june'      => 'มิถุนายน',
    'july'      => 'กรกฎาคม',
    'august'    => 'สิงหาคม',
    'september' => 'กันยายน',
    'october'   => 'ตุลาคม',
    'november'  => 'พฤศจิกายน',
    'december'  => 'ธันวาคม',

    'monday'    => 'จันทร์',
    'tuesday'   => 'อังคาร',
    'wednesday' => 'พุธ',
    'thursday'  => 'พฤหัสบดี',
    'friday'    => 'ศุกร์',
    'saturday'  => 'เสาร์',
    'sunday'    => 'อาทิตย์',


 'monthNames'  => array (
  'wide' =>
  array (
    1 => 'มกราคม',
    2 => 'กุมภาพันธ์',
    3 => 'มีนาคม',
    4 => 'เมษายน',
    5 => 'พฤษภาคม',
    6 => 'มิถุนายน',
    7 => 'กรกฎาคม',
    8 => 'สิงหาคม',
    9 => 'กันยายน',
    10 => 'ตุลาคม',
    11 => 'พฤศจิกายน',
    12 => 'ธันวาคม',
  ),
  'abbreviated' =>
  array (
    1 => 'ม.ค.',
    2 => 'ก.พ.',
    3 => 'มี.ค.',
    4 => 'เม.ย.',
    5 => 'พ.ค.',
    6 => 'มิ.ย.',
    7 => 'ก.ค.',
    8 => 'ส.ค.',
    9 => 'ก.ย.',
    10 => 'ต.ค.',
    11 => 'พ.ย.',
    12 => 'ธ.ค.',
  ),
  'narrow' =>
  array (
    1 => 'ม.ค.',
    2 => 'ก.พ.',
    3 => 'มี.ค.',
    4 => 'เม.ย.',
    5 => 'พ.ค.',
    6 => 'มิ.ย',
    7 => 'ก.ค.',
    8 => 'ส.ค.',
    9 => 'ก.ย.',
    10 => 'ต.ค.',
    11 => 'พ.ย.',
    12 => 'ธ.ค.',
  ),
),

 'weekDayNames'  => array (
  'wide' =>
  array (
    0 => 'วันอาทิตย์',
    1 => 'วันจันทร์',
    2 => 'วันอังคาร',
    3 => 'วันพุธ',
    4 => 'วันพฤหัสบดี',
    5 => 'วันศุกร์',
    6 => 'วันเสาร์',
  ),
  'abbreviated' =>
  array (
    0 => 'อา.',
    1 => 'จ.',
    2 => 'อ.',
    3 => 'พ.',
    4 => 'พฤ.',
    5 => 'ศ.',
    6 => 'ส.',
  ),
  'narrow' =>
  array (
    0 => 'อา.',
    1 => 'จ.',
    2 => 'อ.',
    3 => 'พ.',
    4 => 'พฤ.',
    5 => 'ศ.',
    6 => 'ส.',
  ),
  'short' =>
  array (
    0 => 'อา.',
    1 => 'จ.',
    2 => 'อ.',
    3 => 'พ.',
    4 => 'พฤ.',
    5 => 'ศ.',
    6 => 'ส.',
  ),
),

 'eraNames'  => array (
  'abbreviated' =>
  array (
    0 => 'ปีก่อน ค.ศ.',
    1 => 'ค.ศ.',
  ),
  'wide' =>
  array (
    0 => 'ปีก่อนคริสต์ศักราช',
    1 => 'คริสต์ศักราช',
  ),
  'narrow' =>
  array (
    0 => 'ก่อน ค.ศ.',
    1 => 'ค.ศ.',
  ),
),

 'dateFormats'  => array (
  'full' => 'EEEEที่ d MMMM G y',
  'long' => 'd MMMM y',
  'medium' => 'd MMM y',
  'short' => 'd/M/yy',
),

 'timeFormats'  => array (
  'full' => 'H นาฬิกา mm นาที ss วินาที zzzz',
  'long' => 'H นาฬิกา mm นาที ss วินาที z',
  'medium' => 'HH:mm:ss',
  'short' => 'HH:mm',
),

 'dateTimeFormat'  => '{1}, {0}',

);
